Revit 2026 API

# ElementTransformUtilsCopyElements(Document, ICollectionElementId, Document, Transform, CopyPasteOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> CopyElements(
	Document sourceDocument,
	ICollection<ElementId> elementsToCopy,
	Document destinationDocument,
	Transform transform,
	CopyPasteOptions options
)
```
```vb
Public Shared Function CopyElements (
	sourceDocument As Document,
	elementsToCopy As ICollection(Of ElementId),
	destinationDocument As Document,
	transform As Transform,
	options As CopyPasteOptions
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ CopyElements(
	Document^ sourceDocument,
	ICollection<ElementId^>^ elementsToCopy,
	Document^ destinationDocument,
	Transform^ transform,
	CopyPasteOptions^ options
)
```
```fsharp
static member CopyElements :
        sourceDocument : Document *
        elementsToCopy : ICollection<ElementId> *
        destinationDocument : Document *
        transform : Transform *
        options : CopyPasteOptions -> ICollection<ElementId>
```

#### Parameters

sourceDocument Document

elementsToCopy ICollectionElementId

destinationDocument Document

transform Transform

options CopyPasteOptions

#### Return Value

ICollectionElementId

#### Reference

ElementTransformUtils Class

CopyElements Overload

Autodesk.Revit.DB Namespace